In [1]:
import pandas as  pd

In [3]:
df=pd.read_csv("sample_data2.csv")
df.head()

   Serial Number               Title   Salary Qualification  Exp
0              1   Software Engineer  20000.0     Bachelors    3
1              2      Data Scientist  23000.0       Masters    4
2              3     Project Manager  18000.0       Masters    2
3              4           Professor  25000.0     Bachelors    5
4              5  Database Architect  17000.0     Bachelors    1

In [4]:
df.shape

(9, 5)

In [5]:
df.describe()

       Serial Number        Salary       Exp
count       9.000000      8.000000  9.000000
mean        4.777778  18252.875000  3.000000
std         2.728451   8023.723422  1.870829
min         1.000000     23.000000  0.000000
25%         3.000000  17750.000000  2.000000
50%         4.000000  19000.000000  3.000000
75%         7.000000  23500.000000  5.000000
max         9.000000  25000.000000  5.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Serial Number  9 non-null      int64
 1   Title          9 non-null      object
 2   Salary         8 non-null      float64
 3   Qualification  8 non-null      object
 4   Exp            9 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 492.0+ bytes

In [7]:
df.isnull().sum()

Serial Number    0
Title            0
Salary           1
Qualification    1
Exp              0
dtype: int64

In [9]:
df.Salary.median()

np.float64(19000.0)

In [10]:
df.Qualification.mode()

0    Bachelors
Name: Qualification, dtype: object

In [11]:
df.fillna({'Salary':df.Salary.median(),'Qualification':df.Qualification.mode()[0]},inplace=True)

In [12]:
df.isnull().sum()

Serial Number    0
Title            0
Salary           0
Qualification    0
Exp              0
dtype: int64

In [13]:
df.head()

   Serial Number               Title   Salary Qualification  Exp
0              1   Software Engineer  20000.0     Bachelors    3
1              2      Data Scientist  23000.0       Masters    4
2              3     Project Manager  18000.0       Masters    2
3              4           Professor  25000.0     Bachelors    5
4              5  Database Architect  17000.0     Bachelors    1

In [14]:
df['Salary'].max()

np.float64(25000.0)

In [16]:
df.loc[df['Salary'].idxmax(), ['Title','Salary']]

Title     Professor
Salary      25000.0
Name: 3, dtype: object

In [17]:
print(df)

   Serial Number               Title   Salary Qualification  Exp
0              1   Software Engineer  20000.0     Bachelors    3
1              2      Data Scientist  23000.0       Masters    4
2              3     Project Manager  18000.0       Masters    2
3              4           Professor  25000.0     Bachelors    5
4              5  Database Architect  17000.0     Bachelors    1
5              4           Professor  25000.0     Bachelors    5
6              7    Business Analyst  18000.0     Bachelors    5
7              8     UX/UI Developer     23.0     Bachelors    0
8              9     Devops Engineer  19000.0       Masters    2

In [18]:
df.nlargest(5,'Salary')

   Serial Number              Title   Salary Qualification  Exp
3              4          Professor  25000.0     Bachelors    5
5              4          Professor  25000.0     Bachelors    5
1              2     Data Scientist  23000.0       Masters    4
0              1  Software Engineer  20000.0     Bachelors    3
8              9    Devops Engineer  19000.0       Masters    2

In [19]:
df['Qualification'].value_counts()

Qualification
Bachelors    6
Masters      3
Name: count, dtype: int64

In [21]:
df=pd.read_csv('Movie.csv')

In [22]:
df.head()

   userId             movie  rating
0       3  Toy Story (1995)     4.0
1       6  Toy Story (1995)     5.0
2       8  Toy Story (1995)     4.0
3      10  Toy Story (1995)     4.0
4      11  Toy Story (1995)     4.5

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8992 entries, 0 to 8991
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   userId  8992 non-null   int64
 1   movie   8992 non-null   object
 2   rating  8992 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 210.9+ KB

In [ ]:
# Sum of ratings per movie
df.groupby('movie')['rating'].sum().reset_index()

                                movie   rating
0  Father of the Bride Part II (1995)   2065.5
1                    GoldenEye (1995)   5305.0
2             Grumpier Old Men (1995)   2183.0
3                         Heat (1995)   4834.0
4                      Jumanji (1995)   3775.0
5                      Sabrina (1995)   2367.0
6                 Sudden Death (1995)    609.5
7                 Tom and Huck (1995)    261.5
8                    Toy Story (1995)  10171.5
9            Waiting to Exhale (1995)    414.0

In [31]:
# Average ratings per movie
df.groupby('movie')['rating'].mean().reset_index()

                                movie    rating
0  Father of the Bride Part II (1995)  3.143836
1                    GoldenEye (1995)  3.427003
2             Grumpier Old Men (1995)  3.186861
3                         Heat (1995)  3.836508
4                      Jumanji (1995)  3.268398
5                      Sabrina (1995)  3.381429
6                 Sudden Death (1995)  3.017327
7                 Tom and Huck (1995)  3.352564
8                    Toy Story (1995)  3.959323
9            Waiting to Exhale (1995)  3.000000

In [30]:
# 3 movies with lowest rating
df.groupby('movie')['rating'].mean().reset_index().nsmallest(3,'rating')

                                movie    rating
9            Waiting to Exhale (1995)  3.000000
6                 Sudden Death (1995)  3.017327
0  Father of the Bride Part II (1995)  3.143836